In [1]:
import pandas as pd

In [2]:
# Creation of data frames using string
s = "hi hello fine".split()
pd.DataFrame(s)

       0
0     hi
1  hello
2   fine

In [6]:
s1 = "how are you i am fine".split()
pd.DataFrame(s1)

      0
0   how
1   are
2   you
3     i
4    am
5  fine

In [7]:
# creation of data frames using list
li = [[1,2,3],[4,5,6]]
pd.DataFrame(li)

   0  1  2
0  1  2  3
1  4  5  6

In [8]:
# creation of data frames using list
li = [[1,2,3],[4,5,6]]
pd.DataFrame(li,index=['list1','list2'])

       0  1  2
list1  1  2  3
list2  4  5  6

In [42]:
# creation of data frames using dictionary
d = {'key1':'h1','key2':'h2','key3':'h3'}
df1 = pd.DataFrame(d,index=[1,2,3])
df1

  key1 key2 key3
1   h1   h2   h3
2   h1   h2   h3
3   h1   h2   h3

In [43]:
# creation of data frames using dictionary
d1 = {'name':['vanitha','vasu','vamsi','rani'],
       'roll no':[11,12,13,45],'Branch':['CSE','ECE','MECH','EEE']}
df = pd.DataFrame(d1)
print(df)

      name  roll no Branch
0  vanitha       11    CSE
1     vasu       12    ECE
2    vamsi       13   MECH
3     rani       45    EEE

In [44]:
# creation of data frames using numpy array-2d
import pandas as pd
import numpy as np
k = np.array([[23,56,78],[78,34,67]])
df2 = pd.DataFrame(k)
print(df2)

    0   1   2
0  23  56  78
1  78  34  67

In [45]:
# creation of data frames using tuple()
import pandas as pd
t1= ((3,33,45),(44,12,78))
df3 = pd.DataFrame(t1)
df3

    0   1   2
0   3  33  45
1  44  12  78

In [46]:
print(df)

      name  roll no Branch
0  vanitha       11    CSE
1     vasu       12    ECE
2    vamsi       13   MECH
3     rani       45    EEE

In [47]:
# To get columns
df.columns

Index(['name', 'roll no', 'Branch'], dtype='object')

In [48]:
# To get the number of records
print(len(df.values))

4

In [49]:
# To get the row values
print(df.values)

[['vanitha' 11 'CSE']
 ['vasu' 12 'ECE']
 ['vamsi' 13 'MECH']
 ['rani' 45 'EEE']]

In [50]:
# To get the index positions
print(df.index)

RangeIndex(start=0, stop=4, step=1)

In [51]:
print(df)

      name  roll no Branch
0  vanitha       11    CSE
1     vasu       12    ECE
2    vamsi       13   MECH
3     rani       45    EEE

In [52]:
# To get the no of rows and columns
print(df.shape)

(4, 3)

In [53]:
# Pandas DataFrames indexing
    #  Using row index or column names

In [54]:
print(df['name'])

0    vanitha
1       vasu
2      vamsi
3       rani
Name: name, dtype: object

In [55]:
print(df[['roll no','Branch']])

   roll no Branch
0       11    CSE
1       12    ECE
2       13   MECH
3       45    EEE

In [56]:
# head()--> To get first 5 records
# head(1)---> To get 1st record
df.head()

      name  roll no Branch
0  vanitha       11    CSE
1     vasu       12    ECE
2    vamsi       13   MECH
3     rani       45    EEE

In [57]:
df.head(1)

      name  roll no Branch
0  vanitha       11    CSE

In [58]:
print(df.head(3))
print(df.head(4))

      name  roll no Branch
0  vanitha       11    CSE
1     vasu       12    ECE
2    vamsi       13   MECH
      name  roll no Branch
0  vanitha       11    CSE
1     vasu       12    ECE
2    vamsi       13   MECH
3     rani       45    EEE

In [59]:
# tail()---> To get last 5 records
# tail(1)---> To get last record
df.tail(5)

      name  roll no Branch
0  vanitha       11    CSE
1     vasu       12    ECE
2    vamsi       13   MECH
3     rani       45    EEE

In [60]:
df.tail(1)

   name  roll no Branch
3  rani       45    EEE

In [61]:
## To add new record to data frame
df.loc[4]=['Sony','8374','BBA']
print(df)

      name roll no Branch
0  vanitha      11    CSE
1     vasu      12    ECE
2    vamsi      13   MECH
3     rani      45    EEE
4     Sony    8374    BBA

In [62]:
# To add new column
df['marks']=[34,68,789,11,78]
print(df)

      name roll no Branch  marks
0  vanitha      11    CSE     34
1     vasu      12    ECE     68
2    vamsi      13   MECH    789
3     rani      45    EEE     11
4     Sony    8374    BBA     78

In [63]:
# particular value update
df.loc[3,'Branch']='Arts'
df

      name roll no Branch  marks
0  vanitha      11    CSE     34
1     vasu      12    ECE     68
2    vamsi      13   MECH    789
3     rani      45   Arts     11
4     Sony    8374    BBA     78

In [64]:
# To get particular record details in data frames
df.loc[2]

name       vamsi
roll no       13
Branch      MECH
marks        789
Name: 2, dtype: object

In [65]:
## To delete the row or column ----> drop()
## rows wise---> axis=0
### columns wise---> axis=1
print(df)

      name roll no Branch  marks
0  vanitha      11    CSE     34
1     vasu      12    ECE     68
2    vamsi      13   MECH    789
3     rani      45   Arts     11
4     Sony    8374    BBA     78

In [66]:
# particular row delete
df = df.drop(2,axis=0)
df

      name roll no Branch  marks
0  vanitha      11    CSE     34
1     vasu      12    ECE     68
3     rani      45   Arts     11
4     Sony    8374    BBA     78

In [90]:
# To delete the particular column
df = df.drop('Branch',axis=1)
df

      name roll no  marks
0  vanitha      11     34
1     vasu      12     68
3     rani      45     11
4     Sony    8374     78

In [91]:
# To print the specific value
df.loc[3,'name']

'rani'

In [92]:
print(df)

      name roll no  marks
0  vanitha      11     34
1     vasu      12     68
3     rani      45     11
4     Sony    8374     78

In [99]:
# To rename the particular single column name
df.rename(columns={'roll no':'Rno'},inplace=True)
df

      name   Rno  marks
0  vanitha    11     34
1     vasu    12     68
3     rani    45     11
4     Sony  8374     78

In [100]:
# Rename multiple column names 
df.columns=['NAME','ROLL NO','MARKS']
df

      NAME ROLL NO  MARKS
0  vanitha      11     34
1     vasu      12     68
3     rani      45     11
4     Sony    8374     78

In [103]:
print(df1)

  key1 key2 key3
1   h1   h2   h3
2   h1   h2   h3
3   h1   h2   h3

In [106]:
# To delete all row records
df2.drop(df2.index,inplace=True)
df2

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [107]:
# To delete the entire columns
df2.drop(df2.columns,inplace=True,axis=1)
df2

Empty DataFrame
Columns: []
Index: []

In [71]:
#### File input/output reading in pandas
df2 = pd.read_csv('marks.csv')
df2

  name  rno    branch   c  java  python
0    a    1       cse  23    45      56
1    b    2       ece  45    67      11
2    c    3        me  56    12      45
3    d    7      arts  67    78      89
4    e    8  commerce  67    80      66

In [72]:
df2.shape

(5, 6)

In [73]:
# sorting using  single column name
df2.sort_values('java')

  name  rno    branch   c  java  python
2    c    3        me  56    12      45
0    a    1       cse  23    45      56
1    b    2       ece  45    67      11
3    d    7      arts  67    78      89
4    e    8  commerce  67    80      66

In [74]:
df2.sort_values('python')
df2

  name  rno    branch   c  java  python
0    a    1       cse  23    45      56
1    b    2       ece  45    67      11
2    c    3        me  56    12      45
3    d    7      arts  67    78      89
4    e    8  commerce  67    80      66

In [75]:
df2.sort_values('branch')
df2

  name  rno    branch   c  java  python
0    a    1       cse  23    45      56
1    b    2       ece  45    67      11
2    c    3        me  56    12      45
3    d    7      arts  67    78      89
4    e    8  commerce  67    80      66

In [76]:
df2.sort_values('python')

  name  rno    branch   c  java  python
1    b    2       ece  45    67      11
2    c    3        me  56    12      45
0    a    1       cse  23    45      56
4    e    8  commerce  67    80      66
3    d    7      arts  67    78      89

In [80]:
df2.sort_values('c',ascending=False)
print(df2)

  name  rno    branch   c  java  python
0    a    1       cse  23    45      56
1    b    2       ece  45    67      11
2    c    3        me  56    12      45
3    d    7      arts  67    78      89
4    e    8  commerce  67    80      66